zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cm_jh/pic32cm_jh00/pic32cm6408jh00064-pinctrl.h
/* pb17h_gclk_io3 */
#define PB17H_GCLK_IO3 MCHP_PINMUX(b, 17, h, periph)

/* pb17i_ccl_out3 */
#define PB17I_CCL_OUT3 MCHP_PINMUX(b, 17, i, periph)

/* pb22_gpio */
#define PB22_GPIO MCHP_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 MCHP_PINMUX(b, 22, a, periph)

/* pb22e_tc3_wo0 */
#define PB22E_TC3_WO0 MCHP_PINMUX(b, 22, e, periph)

/* pb22h_gclk_io0 */
#define PB22H_GCLK_IO0 MCHP_PINMUX(b, 22, h, periph)

/* pb22i_ccl_in0 */
#define PB22I_CCL_IN0 MCHP_PINMUX(b, 22, i, periph)

/* pb23_gpio */
#define PB23_GPIO MCHP_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 MCHP_PINMUX(b, 23, a, periph)

/* pb23e_tc3_wo1 */
#define PB23E_TC3_WO1 MCHP_PINMUX(b, 23, e, periph)

/* pb23h_gclk_io1 */
#define PB23H_GCLK_IO1 MCHP_PINMUX(b, 23, h, periph)

/* pb23i_ccl_out0 */
#define PB23I_CCL_OUT0 MCHP_PINMUX(b, 23, i, periph)

/* pb30_gpio */
#define PB30_GPIO MCHP_PINMUX(b, 30, gpio, gpio)

/* pb30a_eic_extint14 */
#define PB30A_EIC_EXTINT14 MCHP_PINMUX(b, 30, a, periph)

/* pb30e_tcc0_wo0 */
#define PB30E_TCC0_WO0 MCHP_PINMUX(b, 30, e, periph)

/* pb30f_tcc1_wo2 */
#define PB30F_TCC1_WO2 MCHP_PINMUX(b, 30, f, periph)

/* pb30h_ac_cmp2 */
#define PB30H_AC_CMP2 MCHP_PINMUX(b, 30, h, periph)

/* pb31_gpio */
#define PB31_GPIO MCHP_PINMUX(b, 31, gpio, gpio)

/* pb31a_eic_extint15 */
#define PB31A_EIC_EXTINT15 MCHP_PINMUX(b, 31, a, periph)

/* pb31e_tcc0_wo1 */
#define PB31E_TCC0_WO1 MCHP_PINMUX(b, 31, e, periph)

/* pb31f_tcc1_wo3 */
#define PB31F_TCC1_WO3 MCHP_PINMUX(b, 31, f, periph)

/* pb31h_ac_cmp3 */
#define PB31H_AC_CMP3 MCHP_PINMUX(b, 31, h, periph)

#endif /* MICROCHIP_PIC32CM6408JH00064_PINCTRL_H_ */
